---
kind: property
id: P:Autodesk.Revit.DB.Visual.Marble.TextureAngle
source: html/99c919a4-3ce6-a5e9-1992-0ba12dddc5e7.htm
---
# Autodesk.Revit.DB.Visual.Marble.TextureAngle Property

The property labeled "Angle" from the "Marble" schema.

## Syntax (C#)
```csharp
public static string TextureAngle { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray3d".